# dataFrames2

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [5]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df["W"] #it will print the Serise values

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df["W"]["A"]

2.706849839399938

In [8]:
type(df["W"]) #get the type of the variable

pandas.core.series.Series

In [9]:
df[["W","Z"]] # it will print the set Serise values

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [10]:
df["new"] = df["W"] + df["Z"] #create a new column

In [11]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [12]:
df.drop("new", axis=1,inplace=True)  #inplace is used to permenantly removed
#axis is used to idetify rows or colum if axis is 1 that means coloumn axis is 0 that means row

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.drop("E",axis=0) #form this we don't need to give the axis value by default its a 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df.loc['A'] #location based

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [17]:
df.iloc[0] #index based

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [18]:
df.loc['B','Y'] #B row and Y column

-0.8480769834036315

In [19]:
df.loc[['A','B'],['X','Z']] #give the set of serise

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

In [20]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
booldf = df > 0 #it will return with true false if

In [23]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [25]:
df[booldf] #for the true will get the actual value of df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df[df > 0] #same as a above

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [31]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['Z'] < 0 ] #will give a series if the Z colom is having greater than Zero value

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [34]:
df['W']['A']

2.706849839399938

In [35]:
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [43]:
boolser = df['W'] > 0 #it will give the true false of the W coloum

In [44]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [45]:
result_arr = df[boolser]

In [48]:
result_arr

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
#muliple conditions

In [55]:
df[(df['W'] > 0) & (df['Y'] > 1)] #multiple condtions can't use normal 'and' for make the condtion and => & or => pipe operator"

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df.reset_index() #it will reset the index of series

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [59]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
new_ind = 'CA NY Wy QR CO'.split()

In [61]:
new_ind

['CA', 'NY', 'Wy', 'QR', 'CO']

In [68]:
df['States'] = new_ind

In [73]:
df

          W         X         Y         Z states States
A  2.706850  0.628133  0.907969  0.503826     CA     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY     NY
C -2.018168  0.740122  0.528813 -0.589001     Wy     Wy
D  0.188695 -0.758872 -0.933237  0.955057     QR     QR
E  0.190794  1.978757  2.605967  0.683509     CO     CO

In [75]:
df.drop(labels='states',axis=1)

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     Wy
D  0.188695 -0.758872 -0.933237  0.955057     QR
E  0.190794  1.978757  2.605967  0.683509     CO

In [76]:
df.set_index('States')

               W         X         Y         Z states
States
CA      2.706850  0.628133  0.907969  0.503826     CA
NY      0.651118 -0.319318 -0.848077  0.605965     NY
Wy     -2.018168  0.740122  0.528813 -0.589001     Wy
QR      0.188695 -0.758872 -0.933237  0.955057     QR
CO      0.190794  1.978757  2.605967  0.683509     CO